cases/2D/straightChannel/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
phases (cyclohexane ethylene);

cyclohexane
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1e-6;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1000;
}

ethylene
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1.5e-5;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1;
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.072;

solutionSpecies
{
    Ethylene
    {
        DL           1e-09;
        DG           0;
        CLsat        1;
        CGsat        1;
    }
    Cyclohexane
    {
        DL           1e-09;
        DG           0;
        CLsat        1000;
        CGsat        0;
    }
};

surfaceForces
{
    sigma 0.072;
    curvatureModel RDF;
    accelerationModel gravity;
    gravity (0 0 0);
    deltaFunctionModel alphaCSF;
}

// ************************************************************************* //
 
