cases/2D/straightChannel/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue CLVEthylene 1
    volScalarFieldValue CLVLEthylene 1
    volScalarFieldValue CLVCyclohexane 1000
    volScalarFieldValue CGVEthylene 0
    volScalarFieldValue CGVCyclohexane 0
    volScalarFieldValue alpha.cyclohexane 1
);

regions
(
    boxToCell
    {
        box (0.001 0 0) (0.003 1 1);
        fieldValues
        (
            volScalarFieldValue alpha.cyclohexane 0
            volScalarFieldValue CLVEthylene 0
            volScalarFieldValue CLVLEthylene 0
            volScalarFieldValue CGVEthylene 1
            volScalarFieldValue CLVCyclohexane 0
            
        );
    }

    boxToCell
    {
        box (0.00098 0 0) (0.001 1 1);
        fieldValues
        (
            volScalarFieldValue alpha.cyclohexane 0.25
            volScalarFieldValue CLVEthylene 0.25
            volScalarFieldValue CLVLEthylene 1
            volScalarFieldValue CGVEthylene 0.75
            volScalarFieldValue CLVCyclohexane 250
        );
    }
    
    boxToCell
    {
        box (0.003 0 0) (0.00302 1 1);
        fieldValues
        (
            volScalarFieldValue alpha.cyclohexane 0.75
            volScalarFieldValue CLVEthylene 0.75
            volScalarFieldValue CLVLEthylene 1
            volScalarFieldValue CGVEthylene 0.25
            volScalarFieldValue CLVCyclohexane 750
        );
    }
);

// ************************************************************************* //
